postgres_metrics/modified_run_b_postgres_threads_032_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloadb -threads 32 -p recordcount=15585 -P ./postgrenosql/conf/postgrenosql.properties
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 3683
[OVERALL], Throughput(ops/sec), 271.5177844148792
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 10
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.27151778441487917
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 10
[TOTAL_GC_TIME_%], Time(%), 0.27151778441487917
[READ], Operations, 940
[READ], AverageLatency(us), 102925.69893617021
[READ], MinLatency(us), 2722
[READ], MaxLatency(us), 207487
[READ], 95thPercentileLatency(us), 152703
[READ], 99thPercentileLatency(us), 171519
[READ], Return=OK, 940
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 58.6875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 1818
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 1818
[SCAN], Operations, 60
[SCAN], AverageLatency(us), 82778.73333333334
[SCAN], MinLatency(us), 8232
[SCAN], MaxLatency(us), 164735
[SCAN], 95thPercentileLatency(us), 159871
[SCAN], 99thPercentileLatency(us), 163967
[SCAN], Return=OK, 60